import os
from dotenv import load_dotenv

load_dotenv()


STOCK_CODES = [
    "4004", "4062", "5706", "6525", "6857",
    "6871", "6920", "6976", "6981", "7735",
    "285A", "9984", "5803", "166A",
    "5016", "5801", "6954", "6506", "7014",
    "3436", "6723", "7011", "7012", "7013",
    "200A", "6613", "6376", "6055", "6227",
    "7721", "4063", "1969", 
]

INDEX_CODES = [
    "^N225", # 日経
    "^NDX", # ナスダック100
    "^DJI", # ダウ30
    "^SPX", # SP500
    "^SOX", # SOX
    "USDJPY=X", # 為替
    "^VIX", #VIX
]

STOCK_NAMES = {
    "4004": "レゾナックHD", 
    "4062": "イビデン", 
    "5706": "三井金属", 
    "6525": "コクサイ", 
    "6857": "アドバンテスト",
    "6871": "日本マイクロニクス", 
    "6920": "レーザーテック", 
    "6976": "太陽誘電", 
    "6981": "村田製作所", 
    "7735": "スクリンHD",
    "285A": "キオクシアHD", 
    "9984": "ソフトバンクG", 
    "5803": "フジクラ", 
    "166A": "タスキHD",   
    "5016": "JX金属", 
    "5801": "古河電気工業", 
    "6954": "ファナック", 
    "6506": "安川電機", 
    "7014": "名村造船所",
    "3436": "SUMCO", 
    "6723": "ルネサス", 
    "7011": "三菱重工業", 
    "7012": "川崎重工", 
    "7013": "IHI",
    "200A": "NF半導体", 
    "6613": "QDレーザー", 
    "6376": "日機装", 
    "6055": "ジャパンマテリアル", 
    "6227": "AIメカテック",
    "7721": "東京計器", 
    "4063": "信越化学工業", 
    "1969": "高砂熱学工業", 
}

DISCORD_WEBHOOK_URL = os.getenv("DISCORD_WEBHOOK_URL")